{
    "Index": {
        "title": "Вітаємо на siteDoer.pro!",
        "p1": "Я — професійний веб-розробник, що пропонує повний спектр послуг зі створення, розробки та підтримки веб-проектів будь-якої складності. Я працюю індивідуально, гарантуючи особистий підхід до кожного клієнта і проекту.",
        "p2": "У світі, де візуальний вигляд та функціональність сайту визначають успіх вашого бізнесу чи проекту, я пропоную індивідуальні рішення для кожного клієнта. Незалежно від того, чи потрібно вам створити новий веб-сайт з нуля, змінити дизайн існуючого або оптимізувати та підтримувати існуючий ресурс, я готовий втілити ваші ідеї в життя.",
        "p3": "Мої послуги охоплюють усі аспекти веб-розробки, включаючи веб-дизайн, програмування, адаптацію для мобільних пристроїв, SEO-оптимізацію, тестування безпеки та багато іншого. Я використовую сучасні технології та передові практики, щоб забезпечити якісний результат, що відповідає всім сучасним вимогам.",
        "p4": "Звертайтеся до мене, і я допоможу зробити ваш веб-проект помітним, ефективним і успішним!",
        "title2": "Я використовую передові технології для створення веб-сайтів та веб-додатків, зокрема такі як:",
        "p5" :"React: React є однією з найпопулярніших бібліотек JavaScript для розробки інтерфейсів користувача. Це дозволяє нам створювати динамічні та ефективні веб-сторінки, які реагують на дії користувача без перезавантаження сторінки.",
        "p6":"Next.js: Next.js — це популярний фреймворк React для створення універсальних веб-додатків (із відтворенням на стороні сервера). Він надає можливість створювати високопродуктивні й оптимізовані для SEO програми, а також зрозуміле керування маршрутизацією та створення статичних сторінок.",
        "p7":"MongoDB: MongoDB — це документно-орієнтована база даних NoSQL, яка використовується для зберігання та керування даними. Це дозволяє нам ефективно зберігати та обробляти структуровані та неструктуровані дані для наших веб-проектів.",
        "year":"Рік",
        "country":"Країна",
        "project":"Проект",
        "technology":"Технологія",
        "link":"Ссилка",

        "titleItem1": "Корпоративний сайт",
        "priceNewItem1": "від 300$",
        "priceOldItem1": "від 500$",
        "descrItem1": "до 5 сторінок",

        "titleItem2": "Лендінг",
        "priceNewItem2": "від 250$",
        "priceOldItem2": "від 300$",
        "descrItem2": "до 7 розділів",

        "titleItem3": "Інтернет-магазин",
        "priceNewItem3": "від 700$",
        "priceOldItem3": "від 1000$",
        "descrItem3": "кошик, фільтри, оплата, панель адміністратора",

        "titleItem4": "Багатофункціональні платформи",
        "priceNewItem4": "від 1000$",
        "priceOldItem4": "від 2000$",
        "descrItem4": "розширені функціональні можливості",

        "buttonBuy":"замовити",

        "title3": "Про мене",
        "p8": "Моя подорож розпочалася з пошуку світу, де технології і креативність перетинаються, і де кожен рядок коду може створити нову візуальну та функціональну реальність. Мене звати Григорій, і я веб-розробник.",
        "p9": "Змалку я захоплювався комп'ютерами та їх можливостями. Коли я вперше почав створювати свої власні веб-сторінки, я відчув, що знайшов своє призначення. Починаючи з простих проектів на HTML та CSS, я постійно розвивався та вдосконалював свої навички.",
        "p10": "З часом я оволодів новими технологіями та інструментами, такими як JavaScript, бібліотеками/фреймворками, які роблять розробку ще більш ефективною. Мої проекти охоплюють широкий спектр, від корпоративних веб-сайтів до веб-додатків та інтерактивних інтерфейсів.",
        "p11": "Найбільше мене захоплює у ролі веб-розробника можливість перетворювати ідеї та концепції у реальність, створюючи зручні для користувачів та естетично привабливі веб-сайти та додатки. Я завжди шукаю нові виклики та навички, готовий приєднатися до команди, де я можу внести свою творчість та професіоналізм для досягнення загальних цілей.",
        "p12": "Щоб дізнатися більше про мої проекти та навички, я запрошую вас ознайомитися з моїм портфоліо та резюме. Дякую за увагу, і я чекаю на можливості співпраці та зростання в галузі веб-розробки.",
        "buttonDownload":"Завантажити резюме",
  
        "title4": "Зв'яжіться з нами",
        "name": "ім'я",
        "email": "електронна пошта",
        "phone": "телефон",
        "message": "повідомлення",
        "buttonSubmit":"Надіслати",

        "home": "Головна",
        "projects": "Проекти",
        "contact": "Контакти",
        "prices": "Ціни",
        "about": "Про мене"
        
    }
  }