import './globals.css';
import { Inter } from 'next/font/google';

const inter = Inter({ subsets: ['latin'] });

export const metadata = {
  title: 'Студія розробки веб-сайтів | siteDoer.pro',
  description: 'siteDoer.pro - це професійна студія розробки веб-сайтів, яка пропонує першокласний веб-дизайн та розробку. Звертайтеся до нас за індивідуальними веб-рішеннями!',
  keywords: 'розробка веб-сайтів, веб-дизайн, студія веб-розробки, професійна веб-розробка, індивідуальні веб-рішення, siteDoer.pro, адаптивний дизайн, мобільно-дружні веб-сайти, UI/UX дизайн, розробка фронтенду, розробка бекенду, електронна комерція, розробка CMS, розробка WordPress, розробка Shopify, оптимізація SEO, цифровий маркетинг, технічне обслуговування веб-сайтів, безпека веб-сайтів, досвід користувача, інтерфейс користувача, сумісність з браузерами, доступність веб-сайту, оптимізація продуктивності, хостинг в хмарі, управління вмістом, аналітика веб-сайту, онлайн присутність, брендування, графічний дизайн, дизайн логотипу, переробка веб-сайтів, портфоліо веб-сайтів, веб-сайти для малих бізнесів, корпоративні веб-сайти, веб-сайти для стартапів, посадочні сторінки, шаблони веб-сайтів, індивідуальні веб-додатки, динамічні веб-сайти, статичні веб-сайти, інтерактивні веб-сайти, веб-технології, HTML, CSS, JavaScript, React.js, Vue.js, Angular, Node.js, PHP, Python, Java, розробка баз даних, інтеграція API, платіжні шлюзи, інтеграція з соціальними мережами, написання контенту, інтеграція блогу, онлайн форми, контактні форми, підписка на новини, тестування веб-сайтів, аудит веб-сайтів, тестування користувачів, веб-доступність, швидкість веб-сайту, безпека веб-сайту, резервне копіювання веб-сайту, міграція веб-сайту, хостинг веб-сайту, SSL-сертифікат, реєстрація домену, архітектура веб-сайту, структура веб-сайту, адаптивні зображення, оптимізація для мобільних пристроїв, SEO-френдлі URL-адреси, мета-теги, карта сайту, robots.txt, альтернативний текст, подання в пошукові системи, онлайн маркетинг, цифрова присутність, онлайн видимість, онлайн стратегія, тренди веб-розробки, інноваційні веб-рішення, сучасний веб-дизайн, задоволення клієнтів, залучення користувачів, продуктивність веб-сайту, розвиток онлайн бізнесу, технологічні рішення, цифрова трансформація',
};

export default function RootLayout({ children }) {
  return (
    <html lang="uk">
      <body className={inter.className}>{children}</body>
    </html>
  );
}
